Revit 2024 API
OpenConflictResult Enumeration
 The result of the open conflict.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Since: 2019
Syntax
C#
public enum OpenConflictResult
Visual Basic
Public Enumeration OpenConflictResult
Visual C++
public enum class OpenConflictResult
Members
Member name | Description
KeepLocalChanges |  Keeps the local changes and open the model.
DiscardLocalChangesAndOpenLatestVersion |  Discard the local changes and open the latest version of the model.
Cancel |  Cancel the open action.
DetachFromCentral |  Detach the model from its central model, with worksets preserved.
See Also
Autodesk.Revit.DB Namespace